

create database sxdb;

use sxdb;

drop  table cls;

create table cls(

	cls_id int primary key auto_increment,

	cls_name varchar(50) not null,

	cls_remark varchar(100)

);



insert into cls(cls_name)

values 

	('服装'),('箱包手表'),('手机数码'),('电脑办公'),('家用电器'),

	('食品生鲜'),('酒水饮料'),('母婴童装'),('医药保健'),('运动户外'),

	('汽车用品'),('箱包手表'),('家居厨具'),('家居家装'),('礼品鲜花'),

	('宠物生活'),('图书音像'),('艺术邮币');

	

drop table goods;	

create table goods(

	g_id int primary key auto_increment,

	g_name varchar(100) not null,

	g_price numeric(10,2),

	g_num bigint,

	g_remark varchar(100),

	g_img varchar(100),

	g_cls int(100) not null,

	constraint fk_goods_cls foreign key(g_cls) references cls(cls_id)

);



insert into goods(g_name,g_price,g_num,g_img,g_cls)

values

	('爱奇果 红心猕猴桃 22个板盒装',43.80,5678,'5b693be1Nd1447b12.jpg',6),

	('苏蟹世家 阳澄湖大闸蟹礼券2598型 公蟹4.0两/只 母蟹3.0两/只 8只装螃蟹礼盒',199,2367,'5b432497N032728e1.jpg',6),

	('恒都 牛腱子 1kg/袋 谷饲牛肉300天 （适用卤、炸、炒、炖）',69.9,1255,'574cea75Nbca8cf5b.jpg',6),

	('蒙牛 特仑苏 原味 115g*3 风味酸奶酸牛奶',26.80,12567,'5b7a8661N02037d90.jpg',6),

	('邮星 高邮咸鸭蛋流油 熟20枚1100g',29.9,3678,'5b65180aN0dad57b7.png',6),

	('家美舒达 临安天目山小香薯 单果约重50-150g 中果 红薯 地瓜 约2.5kg装 新鲜蔬菜',29.90,5678,'5b839110N8dadf3e4.jpg',6),

	('泰山原浆（TAISHAN）10°P28天原浆啤酒 520ml*12 整箱装',99.00,5678,'5b1a1a70Nd59eab6e.jpg',6),

	('金世尊阳澄湖大闸蟹礼品卡 螃蟹提货卡 688型 公蟹3.5两 母蟹2.5两 4对装',278,5678,'5b84ba3eN1898f13d.jpg',6),

	('王家渡 眉州东坡香肠 咸鲜味 440g/袋 眉州东坡酒楼同款 川味腊肠 方便速食',59,5678,'5adf087cN359975b1.jpg',6),

	('希菲 儿童牛排套餐10片1000克 腌制调理牛肉生鲜',79,5678,'57d235faNdd6bab19.jpg',6),

	('山东烟台栖霞红富士吃的苹果水果新鲜平安果9-11枚整箱送礼物2.5kg装',24.9,5678,'59bb5645N6e291919.jpg',6),

	('星龙港 辽宁大连冷冻即食海参 8A级野生底播辽刺参 【买一赠一】500g 8-10头 家庭装',328,5678,'5b4c0841Nc7a5461d.jpg',6),

	('云南蒙自石榴甜石榴 6个装石榴水果',29.9,5678,'5b862db0Nb7c9cf6b.jpg',6),

	('泰国进口龙眼 精选一级果1kg装 新鲜水果',28.9,5678,'5a30f676N29e74e73.jpg',6),

	('法国原装进口鲜活吉拉多生蚝Gillardeau12只木箱吉娜朵 1号',418,5678,'5a323a99N60d04823.jpg',6),

	('绿鲜知 都市轻食 沙拉菜组合 约700g 新鲜蔬菜',21.80,5678,'58f0a6e2Ne90f3e12.jpg',6),

	('南非进口红西柚葡萄柚 柚子 优选大果 4个装 单果重约380g-420g 新鲜水果',34.9,5678,'5b28c4b4N6ca1eb70.jpg',6),

	('美国进口车厘子 2磅装 果径约26-28mm 新鲜水果',98.9,5678,'5b027bb4Naf8b8fa3.jpg',6),

	('都乐Dole 菲律宾进口无冠金菠萝 优选大果 1个装 单果重约1.5kg 新鲜水果',32.9,5678,'5aaa2f36N9b145ea4.jpg',6),

	('Zespri佳沛 新西兰阳光金奇异果 22-25个原箱装 特大22-25号果 单果重约134-175g 新鲜水果',169.9,5678,'5b629546Na37a9a4a.jpg',6),

	('泰国进口山竹5A级 500g 新鲜水果',24.9,5678,'5a6595afN4cbebc2e.jpg',6),

	('榴鲜生榴莲 猫山王榴莲D197马来西亚进口冷冻新鲜水果500g',278,5678,'5b30891fNfe2b7576.jpg',6),

	('泰国进口山竹 顺丰空运发货 2kg装',149,5678,'5899a140N189f9e9a.jpg',6),

	('亿美达 红蕉贵妃蕉新鲜水果福建土楼特产新鲜水果现割现发货(3斤装/5斤装)美人蕉玫瑰火龙蕉 红皮香蕉 3斤',28,5678,'5b18cc28N0f772592.jpg',6),

	('现货 顺风龙宫果 新鲜水果琵琶 黄皮果 3斤',108,5678,'59685768Ne6a3e766.jpg',6),

	('一果人生 澳大利亚进口澳柑 非广西北海沃柑 新鲜水果 柑橘子 1500g',69.9,5678,'5a7308fbN8b7d8488.jpg',6),

	('洋世家 原装进口冷冻野生阿根廷红虾 L1 2kg 30-40只 盒装 火锅食材 海鲜水产',135,5678,'592fbc0aNa95bd81c.jpg',6),

	('美威 智利原味三文鱼整条(大西洋鲑 整条轮切) 4kg 礼盒装 海鲜礼盒',599,5678,'5a445ac1N3696405c.jpg',6),

	('南极直达（S·KING）冷冻冰岛红极参条 北极海参 200g 8-15条 袋装 即食 海鲜水产',59.9,5678,'5a14e1f8Ndce9373f.jpg',6),

	('【活鲜】Gfresh 法国吉拉多生蚝（牡蛎）N1号 6只装 海鲜水产',239,5678,'5aaf9d6aNc76b525d.jpg',6);

	
